#include<iostream>

using namespace std;

int main() {
	//二维数组定义方式

	//1. 数据类型 数组名[行数][列数]
	int arr1[2][3];

	//2. 数据类型 数组名[ 行数][列数]={数据1，数据2},{数据3，数据4}
	int arr2[2][3] = {
		{1,2,3},
		{4,5,6}
	};
	//外层循环打印行数
	for (int i = 0; i < 2; i++)
	{
		//内层循环打印列数
		for (int j = 0; j < 3; j++) {
			cout << arr2[i][j] << " ";
		}
		cout << endl;
	}

	//3. 数据类型 数组名[ 行数][列数]={数据1,数据2,数据3,数据4}
	int arr3[2][3] = { 1,2,3,4,5,6 };

	//4. 数据类型 数组名[ ][列数]={数据1,数据2,数据3,数据4}
	int arr4[][3] = { 1,2,3,4,5,6 };

	return 0;
}