#include<iostream>

using namespace std;

int main() {
	//for循环
	//从数字0 打印到数字9
	/*for (int i = 0; i < 10; i++)
	{
		cout << i << endl;
	}*/
	//敲桌子案例
	/*1. 先输出1-100这些数字
	  2. 从这100个数字中找到特殊数字，改为"敲桌子"
		 特殊数字：
			7的倍数(7 14 21 28...) % 7 = 0
			个位有7(7 17 27 37...) % 10 = 7
			十位有7(70 71 72 73...) /10 = 7*/

			//1. 先输出1-100数字
	for (int i = 1; i <= 100; i++)
	{
		//2. 寻找特殊数字
		if (i % 7 == 0 || i % 10 == 7 || i / 10 == 7) {
			cout << "敲桌子" << endl;
		}
		else {
			cout << i << endl;
		}
	}

	return 0;
}